'number' + 3 + 3
// Результат: "number33"
// Открываем браузер и в окне разработчика вводим console.log('number' + 3 + 3);
// ожидаемый результат 'number33'

null + 3
// Результат: 3

5 && "qwerty"
// Результат: "qwerty"	

'6' + 3 ** 0
// Результат: '61'

12 / '6'
// Результат: 2

'10' + (5 === 6)
// Результат: '10false'

null == ''
// Результат: false

3 ** (9 / 3)
// Результат: 27

!!'false' == !!'true'
// Результат: true

0 || '0' && 1
	// Результат: 1

	(+ null == false) < 1
// Результат: false

false && true || true
// Результат: true